## Dates and time with Pandas

In [2]:
import pandas as pd

In [3]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [12]:
ufo.Time.str.slice(-5,-3).head()

0    22
1    20
2    14
3    13
4    19
Name: Time, dtype: object

In [13]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [14]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [19]:
ufo.Time.dt.month.head()

0    6
1    6
2    2
3    6
4    4
Name: Time, dtype: int64

In [22]:
ufo.Time.dt.month_name().head()

0        June
1        June
2    February
3        June
4       April
Name: Time, dtype: object

In [23]:
ufo.Time.dt.weekday.head()

0    6
1    0
2    6
3    0
4    1
Name: Time, dtype: int64

In [33]:
ufo.Time.dt.day_name().head()

0     Sunday
1     Monday
2     Sunday
3     Monday
4    Tuesday
Name: Time, dtype: object